LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
/* app.c
 *
 * Author: Evzen Steif
 *
 * Description:
 *   Main application state machine for the air quality node.
 *   Handles measurements, communication (LoRa / Matter), VOC processing,
 *   power management (STOP2 / rails), GUI updates on the E-Ink display,
 *   configuration mode over UART, and battery monitoring.
 */

#include "app.h"

#include <stdio.h>
#include <string.h>
#include <stdint.h>


/* Peripherals / drivers */
#include "SDC41.h"
#include "SGP40.h"
#include "WioE5.h"
#include "SHT41.h"
#include "GUI.h"
#include "button_handler.h"
#include "RTC.h"
#include "EPD_2in13_V4.h"
#include "bq25185.h"
#include "gpio_sleep.h"
#include "conf_console.h"
#include "esp32c6.h"
#include "m24c02.h"

#include "stm32u0xx_hal_gpio.h"
#include "stm32u0xx_hal_adc.h"
#include "stm32u0xx_hal_lptim.h"


/* Algorithms */
#include "sensirion_gas_index_algorithm.h"

/* ---------------- External handles ---------------- */
extern void SystemClock_Config(void);
extern void MX_ADC1_Init(void);
extern void MX_I2C1_Init(void);
extern void MX_SPI1_Init(void);
extern void MX_USART4_UART_Init(void);
extern void MX_SPI2_Init(void);
extern void MX_USART1_UART_Init(void);

extern ADC_HandleTypeDef   hadc1;
extern I2C_HandleTypeDef   hi2c1;
extern RTC_HandleTypeDef   hrtc;
extern SPI_HandleTypeDef   hspi1;
extern SPI_HandleTypeDef   hspi2;
extern UART_HandleTypeDef  huart1;
extern UART_HandleTypeDef  huart4;
extern LPTIM_HandleTypeDef hlptim2;

extern WioOtaaConfig_t   g_wio;
extern EspC6Context_t    g_esp;

/* ---------------- Power switch control ---------------- */
typedef struct { GPIO_TypeDef* port; uint16_t pin; } PowerSwitch_t;
static const PowerSwitch_t PS_SENSORS = { PS1_GPIO_Port, PS1_Pin };
static const PowerSwitch_t PS_RF      = { PS2_GPIO_Port, PS2_Pin };
static const PowerSwitch_t PS_EINK    = { PS4_GPIO_Port, PS4_Pin };

#define PS_ON(ps)  HAL_GPIO_WritePin((ps).port, (ps).pin, GPIO_PIN_SET)
#define PS_OFF(ps) HAL_GPIO_WritePin((ps).port, (ps).pin, GPIO_PIN_RESET)

/* I2C isolation helpers (defined later) */
static void I2C_Bus_Release_For_PowerOff(void);
static void I2C_Bus_Restore_For_PowerOn(void);

/* Pins to keep active during sleep (everything else -> Analog/High-Z) */
static const KeepPin KEEP_PINS[] = {
    { USB_ON_GPIO_Port, USB_ON_Pin },
    { BUTTON_GPIO_Port, BUTTON_Pin },
    { RF_TX_GPIO_Port, RF_TX_Pin },
	{ RF_RX_GPIO_Port, RF_RX_Pin },
    { RF_RST_GPIO_Port, RF_RST_Pin },
	{ RF_GPIO1_GPIO_Port, RF_GPIO1_Pin }, // ESP_WAKE pin
	{ RF_GPIO2_GPIO_Port, RF_GPIO2_Pin }, // ESP_READY pin
    { PS2_GPIO_Port, PS2_Pin }, /* RF rail */
    { GPIOA, GPIO_PIN_13 }, // SWDIO (disable in production)
    { GPIOA, GPIO_PIN_14 }, // SWCLK
	{ PULL_CNTR_GPIO_Port, PULL_CNTR_Pin},
};

/* ---------------- Logging helpers ---------------- */
#ifndef LOG_ENABLE
#define LOG_ENABLE 1
#endif

static const char* App_StateName(SystemState_t s);

#if LOG_ENABLE
#define LOGI(fmt, ...) do { printf("[I][STATE=%s] " fmt "\r\n", App_StateName(app.currentState), ##__VA_ARGS__); } while(0)
#define LOGW(fmt, ...) do { printf("[W][STATE=%s] " fmt "\r\n", App_StateName(app.currentState), ##__VA_ARGS__); } while(0)
#define LOGE(fmt, ...) do { printf("[E][STATE=%s] " fmt "\r\n", App_StateName(app.currentState), ##__VA_ARGS__); } while(0)
#define LOGN(fmt, ...) do { printf("[I] " fmt "\r\n", ##__VA_ARGS__); } while(0)
#define LOGB(title)   do { printf("\r\n================ %s ================\r\n", (title)); } while(0)
#else
#define LOGI(...) do{}while(0)
#define LOGW(...) do{}while(0)
#define LOGE(...) do{}while(0)
#define LOGN(...) do{}while(0)
#define LOGB(...) do{}while(0)
#endif

static void LOG_Hex(const uint8_t* buf, size_t len) {
#if LOG_ENABLE
    printf("[I][STATE=%s] Payload: ", App_StateName(app.currentState));
    for (size_t i = 0; i < len; ++i) printf("%02X%s", buf[i], (i + 1U < len) ? " " : "");
    printf("\r\n");
#else
    (void)buf; (void)len;
#endif
}

/* ---------------- ADC sampling parameters ---------------- */
#define VREFINT_SAMPLES 8
#define BAT_SAMPLES     4

/* LPTIM2 ARR to get 10 s at LSE/128 = 256 Hz: 10 s * 256 - 1 */
#define LPTIM2_10S_ARR  (2560U - 1U)

/* ---------------- VOC / algorithm ---------------- */
static GasIndexAlgorithmParams voc_algo;
static uint8_t voc_algo_inited = 0;


/* ---------------- App context (global) ---------------- */
AppContext_t app = {
    /* basic state and flags */
    .currentState        = STATE_INIT,
    .wakeUpFlag          = 0,
    .recalibFlag         = 0,
    .confFlag            = 0,

    /* configuration (later filled from EEPROM / AppConfig_SetDefaults) */
    .cfg                 = {0},   /* intentionally zeroed; real defaults applied via AppConfig_SetDefaults() */

    /* LoRa / ESP state */
    .Connected           = 0,
    .loraNoAckCount      = 0,
    .espFailCount        = 0,

    /* time sync / simple schedulers */
    .time_sync_ok        = 0,
    .lastTimeSyncSeconds = 0xFFFFFFFFU,
    .lastMeasureSeconds  = 0U,
    .lastBatSeconds      = 0U,

    /* E-Ink link */
    .epd_link            = EPD_LINK_CONNECTED, /* default; set to DISCONNECTED to skip GUI */

    /* VOC */
    .voc_last_time       = {0},
    .voc_last_value      = 0,
    .voc_tick            = 0,
    .voc_running         = 0,
    .voc_last_raw        = 0,
    .voc_index_ready     = 0,

    /* boot / TX / GUI bookkeeping */
    .boot_done           = 0,
	.cfg_loaded          = 0,
    .last_sent_seconds   = 0U,
    .baseline_ready      = 0U,
    .gui_drawn_once      = 0U,
};


void AppConfig_SetDefaults(AppConfig_t *cfg)
{
    if (!cfg) return;

    *cfg = (AppConfig_t){
        .measureMode           = MEAS_CO2_TRH,
        .vocMode               = VOC_CONT_USB,
        .commsMode             = COMMS_MATTER,
        .interval_measure_sec  = 30U,
        .interval_sleep_sec    = 30U,
        .interval_time_req_sec = 3600U,
        .interval_bat_sec      = 1U * 60U,

        .tx_min_interval_sec   = 30U,
        .tx_max_interval_sec   = 3600U,
        .th_temp_01C           = 20U,
        .th_rh_01pct           = 100U,
        .th_co2_ppm            = 10U,
    };
}

void App_Config_SaveToEeprom(void)
{
    /* Here you can control sensor power rails / pull-ups
       if the EEPROM shares power with PS_SENSORS or similar. */

	PS_ON(PS_RF);
	HAL_Delay(200);

