LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
    GPIO_PinState prev_pull = HAL_GPIO_ReadPin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin);
    HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_RESET); // enable pull-ups
    PS_ON(PS_SENSORS);
    I2C_Bus_Restore_For_PowerOn();
    HAL_Delay(2);

    HAL_StatusTypeDef st = EE_Config_Save(&hi2c1, &app.cfg, &g_wio, &g_esp.pairing);

    HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, prev_pull);

    if (st == HAL_OK) {
        LOGI("EEPROM: config + WIO OTAA + ESP pairing saved");
    } else {
        LOGE("EEPROM: save failed");
    }

    if (app.cfg.commsMode == COMMS_OFFLINE) PS_OFF(PS_RF);
}

/* ======================= State prototypes ======================= */
static void State_Measure(void);
static void State_BatMeasure(void);
static void State_SendData(void);
static void State_Recover(void);
static void State_GUI(void);
static void State_Sleep(void);
static void State_Recalib(void);
static void State_Config(void);
static void State_TimeReq(void);
static void EPD_PowerOn(void);
static void EPD_PowerOff(void);
static void EPD_BootDetect(void);
static void ESP_ResetPulse(void);
static void App_SendBatteryToEsp(void);



/* ======================= VOC helpers ======================= */
static void VOC_Mode_Ensure(void);
static void VOC_LPTIM_Start(void);
static void VOC_LPTIM_Stop(void);
static inline uint8_t VOC_Active(void) {
    return (app.cfg.vocMode == VOC_CONT_USB) && (app.usb_on != 0);
}
/* ----------------------------------------------------------------------- */

/* ---------------- Helpers ---------------- */
static const char* App_StateName(SystemState_t s) {
    switch (s) {
        case STATE_INIT:           return "INIT";
        case STATE_MEASURE:        return "MEASURE";
        case STATE_BAT_MEASURE:    return "BAT_MEASURE";
        case STATE_SEND_DATA:      return "SEND_DATA";
        case STATE_RECOVER:   	   return "RECOVER";
        case STATE_TIME_REQ:       return "TIME_REQ";
        case STATE_GUI:            return "GUI";
        case STATE_SLEEP:          return "SLEEP";
        case STATE_RECALIBRATION:  return "RECALIBRATION";
        case STATE_CONFIG:		   return "CONFIG";
        default:                   return "UNKNOWN";
    }
}

/* Seconds-of-day helpers (wrap-safe) */
static inline uint32_t sod_now(void) { return RTC_GetSecondsOfDay(); }
static inline uint32_t sod_diff(uint32_t now, uint32_t then) {
    return (then == 0U) ? 0xFFFFFFFFU : (now >= then ? (now - then) : (now + 86400U - then));
}

/* I2C bus isolation helpers: deinit + set pins analog to avoid back-powering. */
static uint8_t s_i2c_forced_analog = 0;

static void I2C_Bus_Release_For_PowerOff(void)
{
    if (s_i2c_forced_analog) return;
    HAL_I2C_DeInit(&hi2c1);

    GPIO_InitTypeDef gi = {0};
    gi.Mode  = GPIO_MODE_ANALOG;
    gi.Pull  = GPIO_NOPULL;
    gi.Speed = GPIO_SPEED_FREQ_LOW;

    if (SCL_GPIO_Port == SDA_GPIO_Port) {
        gi.Pin = SCL_Pin | SDA_Pin;
        HAL_GPIO_Init(SCL_GPIO_Port, &gi);
    } else {
        gi.Pin = SCL_Pin;
        HAL_GPIO_Init(SCL_GPIO_Port, &gi);
        gi.Pin = SDA_Pin;
        HAL_GPIO_Init(SDA_GPIO_Port, &gi);
    }

    s_i2c_forced_analog = 1;
}

static void I2C_Bus_Restore_For_PowerOn(void)
{
    if (!s_i2c_forced_analog) return;
    MX_I2C1_Init();
    s_i2c_forced_analog = 0;
}

/* ======================= TX policy ======================= */
/*
 * Decide if we should transmit the current payload now.
 * Common policy for both LoRa and Matter:
 *  - Never send in COMMS_OFFLINE mode.
 *  - Require a valid baseline.
 *  - Always allow the very first uplink.
 *  - Respect minimum TX interval.
 *  - Force heartbeat after tx_max_interval_sec.
 *  - Otherwise, send only if T/RH/CO2 changed above configured thresholds.
 */
static int ShouldTxNow(void)
{
    /* Offline mode never transmits */
    if (app.cfg.commsMode == COMMS_OFFLINE)
        return 0;

    /* Common policy for both LoRa and Matter (ESP) */
    if (!app.baseline_ready) return 0;

    /* --- FIRST UPLINK: always allowed --- */
    if (app.last_sent_seconds == 0U) return 1;

    const uint32_t now = sod_now();
    const uint32_t dt  = sod_diff(now, app.last_sent_seconds);

    /* Minimum spacing after first TX */
    if (app.last_sent_seconds != 0U && dt < app.cfg.tx_min_interval_sec) return 0;

    /* Heartbeat */
    if (app.cfg.tx_max_interval_sec != 0U &&
        app.last_sent_seconds != 0U &&
        dt >= app.cfg.tx_max_interval_sec) return 1;

    /* Change detection relative to last successfully sent payload */
    const uint16_t prev_t   = (uint16_t)((app.last_sent_payload[0] << 8) | app.last_sent_payload[1]);
    const uint16_t prev_rh  = (uint16_t)((app.last_sent_payload[2] << 8) | app.last_sent_payload[3]);
    const uint16_t prev_co2 = (uint16_t)((app.last_sent_payload[4] << 8) | app.last_sent_payload[5]);

    const uint16_t dT   = (app.temp_data > prev_t)  ? (app.temp_data - prev_t)  : (prev_t  - app.temp_data);
    const uint16_t dRH  = (app.hum_data  > prev_rh) ? (app.hum_data  - prev_rh) : (prev_rh - app.hum_data);
    const uint16_t dCO2 = (app.co2_data  > prev_co2)? (app.co2_data  - prev_co2): (prev_co2- app.co2_data);

    if (dT  >= app.cfg.th_temp_01C)  return 1;
    if (dRH >= app.cfg.th_rh_01pct)  return 1;
    if (dCO2>= app.cfg.th_co2_ppm)   return 1;

    return 0;
}


/* === GUI meta snapshot (values that the GUI shows besides T/RH/CO2) === */
typedef struct {
    uint8_t  Connected;
    uint8_t  usb_on;
    uint32_t sleep_interval_sec;

    /* battery presence (OFF/ON) + voltage in mV */
    uint8_t  socl2_present;
    uint16_t vbat_lsocl2_mV;

    uint8_t  liion_present;
    uint16_t vbat_liion_mV;

    /* charger status (copy as-is) */
    BQ25185_Status_t charger_status;
} GuiMeta_t;

static GuiMeta_t s_gui_meta_prev;
static uint8_t   s_gui_meta_prev_valid = 0;

/* voltage delta to trigger redraw (hysteresis) */
#ifndef GUI_VBAT_DELTA_MV
#define GUI_VBAT_DELTA_MV 50U
#endif

static inline uint8_t diff_bool(uint8_t a, uint8_t b) { return (a != b); }
static inline uint8_t diff_u32(uint32_t a, uint32_t b){ return (a != b); }
static inline uint8_t diff_mv(uint16_t now, uint16_t prev, uint16_t thr)
{
    if (now > prev) return (now - prev) >= thr;
    return (prev - now) >= thr;
}

