LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
static GuiMeta_t BuildGuiMetaSnapshot(void)
{
    GuiMeta_t m;
    m.Connected      = app.Connected ? 1 : 0;
    m.usb_on             = app.usb_on ? 1 : 0;
    m.sleep_interval_sec = app.cfg.interval_sleep_sec;

    m.vbat_lsocl2_mV     = app.vbat_lsocl2_mV;
    m.socl2_present      = (app.vbat_lsocl2_mV >= 1000U) ? 1 : 0;

    m.vbat_liion_mV      = app.vbat_liion_mV;
    m.liion_present      = (app.vbat_liion_mV  >= 1000U) ? 1 : 0;

    m.charger_status     = app.charger_status;
    return m;
}

/* Optional: emoji bucket (coarse category) so GUI updates when crossing thresholds even for small deltas */
static uint8_t emoji_bucket(uint16_t co2_ppm, float tempC) {
    /* CO2 bands: <800, <1200, <2500, >=2500 ; Temp bands: <15, 15..35, >35 */
    uint8_t cb = (co2_ppm < 800) ? 0 : (co2_ppm < 1200) ? 1 : (co2_ppm < 2500) ? 2 : 3;
    uint8_t tb = (tempC   < 15.0f) ? 0 : (tempC   > 35.0f) ? 2 : 1;
    return (uint8_t)((tb << 2) | cb); /* 0..11 */
}

/*
 * Decide whether to perform a full-screen GUI refresh.
 * First refresh is forced, then only when:
 *  - GUI meta (connection, USB, sleep interval, charger state, batteries) changes
 *  - payload changes above thresholds (same as TX)
 *  - emoji bucket changes (coarse air quality categorization)
 */
static int ShouldGUIRefreshNow(void)
{
    if (app.epd_link != EPD_LINK_CONNECTED) return 0;   /* no display */

    /* 1) Always do the very first full-screen draw so the panel isn't blank */
    if (!app.gui_drawn_once) return 1;

    /* 2) Meta states: LoRa, USB, sleep interval, charger status, battery presence/voltage */
    GuiMeta_t cur = BuildGuiMetaSnapshot();
    if (!s_gui_meta_prev_valid) return 1;

    if (diff_bool(cur.Connected, s_gui_meta_prev.Connected)) return 1;
    if (diff_bool(cur.usb_on,        s_gui_meta_prev.usb_on))        return 1;
    if (diff_u32 (cur.sleep_interval_sec, s_gui_meta_prev.sleep_interval_sec)) return 1;

    if (memcmp(&cur.charger_status, &s_gui_meta_prev.charger_status, sizeof(BQ25185_Status_t)) != 0)
        return 1;

    if (diff_bool(cur.socl2_present, s_gui_meta_prev.socl2_present)) return 1;
    if (diff_bool(cur.liion_present, s_gui_meta_prev.liion_present)) return 1;

    if (cur.socl2_present && diff_mv(cur.vbat_lsocl2_mV, s_gui_meta_prev.vbat_lsocl2_mV, GUI_VBAT_DELTA_MV)) return 1;
    if (cur.liion_present && diff_mv(cur.vbat_liion_mV,  s_gui_meta_prev.vbat_liion_mV,  GUI_VBAT_DELTA_MV)) return 1;

    /* 3) Main payload change thresholds (same as TX) */
    const uint16_t prev_t   = (uint16_t)((app.last_gui_payload[0] << 8) | app.last_gui_payload[1]);
    const uint16_t prev_rh  = (uint16_t)((app.last_gui_payload[2] << 8) | app.last_gui_payload[3]);
    const uint16_t prev_co2 = (uint16_t)((app.last_gui_payload[4] << 8) | app.last_gui_payload[5]);

    const uint16_t dT   = (app.temp_data > prev_t)  ? (app.temp_data - prev_t)  : (prev_t  - app.temp_data);
    const uint16_t dRH  = (app.hum_data  > prev_rh) ? (app.hum_data  - prev_rh) : (prev_rh - app.hum_data);
    const uint16_t dCO2 = (app.co2_data  > prev_co2)? (app.co2_data  - prev_co2): (prev_co2- app.co2_data);

    if (dT  >= app.cfg.th_temp_01C)  return 1;
    if (dRH >= app.cfg.th_rh_01pct)  return 1;
    if (dCO2>= app.cfg.th_co2_ppm)   return 1;

    /* 4) Optional: redraw if we crossed emoji bucket thresholds (CO2 800/1200/2500; T 15/35 °C) */
    {
        float curT  = app.temp_data / 100.0f;
        float prevT = prev_t / 100.0f;
        uint8_t buck_cur  = emoji_bucket(app.co2_data, curT);
        uint8_t buck_prev = emoji_bucket(prev_co2,     prevT);
        if (buck_cur != buck_prev) return 1;
    }

    /* 5) Otherwise, no full redraw needed */
    return 0;
}

/* ======================= IRQ handlers ======================= */
void App_WakeUpIRQ(void)
{
	app.wakeUpFlag = 1;
}
void App_UserButtonIRQ_15s(void){ app.recalibFlag = 1; }
void App_UserButtonIRQ_5s(void){  app.confFlag++; }
void App_VOC_TickIRQ(void)  { app.voc_tick = 1; }

void EPD_OnFatalError(void)
{
    static uint8_t once = 0;
    if (once) return;
    once = 1;

    LOGW("EPD fatal/timeout -> disabling GUI");
    app.epd_link = EPD_LINK_DISCONNECTED;
}


/* ======================= Application Init ======================= */
/**
 * Initialize or resume the application.
 *
 * - On wake-up from STOP2: re-initializes clocks and peripherals,
 *   recomputes USB state and optionally refreshes GUI.
 * - On cold boot (first run): performs full hardware and radio initialization,
 *   loads configuration from EEPROM, probes E-Ink presence, and brings up
 *   communication (LoRa or Matter) according to configuration.
 */
/* ======================= App_Init ======================= */
void App_Init(void)
{
    app.confFlag = 0;


    if(app.boot_done == 0)
    {
		EPD_BootDetect();
		app.usb_on = (HAL_GPIO_ReadPin(USB_ON_GPIO_Port, USB_ON_Pin) == GPIO_PIN_SET);

		if (app.epd_link == EPD_LINK_CONNECTED) {
			EPD_PowerOn();
			HAL_Delay(500);
			LOGI("GUI: init");
			GUI_Init();
			if(app.usb_on)
			GUI_UpdateState(app.currentState);
			EPD_PowerOff();
		} else {
			LOGW("E-Ink disconnected -> skipping GUI init");
		}
    }


    if (app.wakeUpFlag && app.boot_done == 1) {
        /* Re-init path after STOP2 */
        app.wakeUpFlag = 0;
        RTC_UpdateTimeData();

        GPIO_Sleep_SetKeepPins(KEEP_PINS, sizeof(KEEP_PINS)/sizeof(KEEP_PINS[0]));
        MX_GPIO_ReInit_Except(KEEP_PINS, sizeof(KEEP_PINS)/sizeof(KEEP_PINS[0]));

        HAL_UART_DeInit(&huart4); MX_USART4_UART_Init();
        HAL_UART_DeInit(&huart1); MX_USART1_UART_Init();
        HAL_SPI_DeInit(&hspi1);   MX_SPI1_Init();
        HAL_SPI_DeInit(&hspi2);   MX_SPI2_Init();
        HAL_I2C_DeInit(&hi2c1);   MX_I2C1_Init();
        HAL_ADC_DeInit(&hadc1);   MX_ADC1_Init();

		EPD_BootDetect();
		app.usb_on = (HAL_GPIO_ReadPin(USB_ON_GPIO_Port, USB_ON_Pin) == GPIO_PIN_SET);

		if (app.epd_link == EPD_LINK_CONNECTED && app.usb_on) {
			EPD_PowerOn();
			HAL_Delay(100);
	        if (!GUI_IsCanvasReady()) {
	            GUI_Init();
	        }
			GUI_UpdateState(app.currentState);
			EPD_PowerOff();
		} else {
			LOGW("E-Ink disconnected -> skipping GUI update");
		}

        LOGB("WAKE-UP");
        LOGI("Wake-up path complete (clocks/peripherals re-initialized)");

        return;
    }

    if (app.boot_done) {
        /* Skip heavy cold boot if not slept. */
        LOGI("Cold boot already done -> light refresh only");
        GPIO_Sleep_SetKeepPins(KEEP_PINS, sizeof(KEEP_PINS)/sizeof(KEEP_PINS[0]));
        return;
    }

