LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
    /* ===== Cold boot path (run once) ===== */
    GPIO_Sleep_SetKeepPins(KEEP_PINS, sizeof(KEEP_PINS)/sizeof(KEEP_PINS[0]));
    ButtonHandler_Init();

    PS_ON(PS_SENSORS);
    HAL_Delay(50);

    /* READY pin (RF_GPIO2) as input with pull-down (or NOPULL depending on HW) */
    HAL_GPIO_DeInit(GPIOC, RF_GPIO2_Pin);
    GPIO_InitTypeDef gi = {0};
    gi.Pin  = RF_GPIO2_Pin;
    gi.Mode = GPIO_MODE_INPUT;
    gi.Pull = GPIO_PULLDOWN;   // or GPIO_NOPULL depending on HW
    HAL_GPIO_Init(GPIOC, &gi);

    /* ---- EEPROM: load config + LoRa + ESP pairing ---- */
    if (!app.cfg_loaded) {
        GPIO_PinState prev_pull = HAL_GPIO_ReadPin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin);
        HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_RESET); // I2C pull-ups ON
        PS_ON(PS_SENSORS);
        I2C_Bus_Restore_For_PowerOn();
        PS_ON(PS_RF);
        HAL_Delay(20);

        if (EE_Config_Load(&hi2c1, &app.cfg, &g_wio, &g_esp.pairing) != HAL_OK) {
            LOGW("EEPROM: invalid/missing -> defaults");
        } else {
            LOGI("EEPROM: config loaded");
        }

        HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, prev_pull);

        app.cfg_loaded = 1;
    }

    LOGI("Config: measure=%d voc=%d comms=%d",
         (int)app.cfg.measureMode, (int)app.cfg.vocMode, (int)app.cfg.commsMode);

    /* === Radio init according to comms mode === */
    if (app.cfg.commsMode == COMMS_MATTER) {
        /* ESP/Matter: do not start WioE5; only prepare ESP */
        PS_ON(PS_RF);
        ESP_Init();
        HAL_Delay(20);
        ESP_ResetPulse();
        HAL_Delay(200);
        LOGI("ESP init: PS_RF ON, READY=input PD, WAKE=LOW");
    } else if (app.cfg.commsMode == COMMS_LORA) {
        /* LoRa: start WioE5 + OTAA join */
        PS_ON(PS_RF);
        HAL_GPIO_WritePin(RF_RST_GPIO_Port, RF_RST_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(RF_GPIO1_GPIO_Port, RF_GPIO1_Pin, GPIO_PIN_SET); /* WAKE high does not disturb WioE5 */
        HAL_Delay(3000);

        LOGI("Initializing WIO-E5 (OTAA)...");
        if (!Wio_EnsureReady(1500)) {
            LOGE("Modem unresponsive!");
        }
        if (!Wio_Init_OTAA()) {
            LOGE("Wio_Init_OTAA failed.");
            app.Connected = 0;
        } else {
            if (Wio_SendCommand("AT+JOIN", "Network joined", 30000)) {
                app.Connected = 1;
                app.loraNoAckCount = 0;
                LOGI("OTAA JOIN OK.");
            } else {
                app.Connected = 0;
                LOGW("OTAA JOIN failed.");
            }
        }
    } else {
        /* Offline: radio off */
        PS_OFF(PS_RF);
    }

    LOGB("BOOT");
    LOGI("Modes: measure=%d, voc=%d, comms=%d",
         (int)app.cfg.measureMode, (int)app.cfg.vocMode, (int)app.cfg.commsMode);

    app.boot_done = 1; /* mark cold boot completed */
}

/* ======================= Application Run ======================= */
/**
 * Main application state machine step.
 *
 * - Reacts to user button flags (recalibration, configuration).
 * - Executes one state handler per call, then transitions to the next state.
 * - Maintains continuous VOC mode, including 10 s raw sampling via LPTIM2.
 * - Updates GUI status line and VOC index when E-Ink and USB are active.
 */
void App_Run(void)
{
    if (app.recalibFlag) app.currentState = STATE_RECALIBRATION;
    if (app.confFlag == 1)    app.currentState = STATE_CONFIG;

    /* Log state header only when the state actually changes */
    static SystemState_t s_prev_logged_state = (SystemState_t)(-1);
    if (app.currentState != s_prev_logged_state) {
        LOGB(App_StateName(app.currentState));
        s_prev_logged_state = app.currentState;
    }

    SystemState_t next_state = app.currentState;

    switch (app.currentState) {
        case STATE_INIT:         App_Init();            next_state = STATE_MEASURE;       break;
        case STATE_MEASURE:      State_Measure();       next_state = STATE_BAT_MEASURE;   break;
        case STATE_BAT_MEASURE:  State_BatMeasure();    next_state = STATE_SEND_DATA;     break;
        case STATE_SEND_DATA:    State_SendData();      next_state = STATE_RECOVER;  	  break;
        case STATE_RECOVER:      State_Recover();       next_state = STATE_TIME_REQ;      break;
        case STATE_TIME_REQ:     State_TimeReq();       next_state = STATE_GUI;           break;
        case STATE_GUI:          State_GUI();           next_state = STATE_SLEEP;         break;
        case STATE_SLEEP:
            State_Sleep();
            if (app.usb_on && app.cfg.vocMode == VOC_CONT_USB)
                next_state = STATE_MEASURE;
            else
                next_state = STATE_INIT;
            break;
        case STATE_RECALIBRATION:
            State_Recalib();
            next_state = STATE_INIT;
            break;
        case STATE_CONFIG:
            /* Stay in CONFIG until the console asks to exit; no spammy header logging */
            State_Config();
            return; /* early return: nothing else this tick */
        default:
            LOGW("Unknown state -> default to INIT");
            next_state = STATE_INIT;
            break;
    }

    /* Apply transition */
    if (app.currentState != next_state) {
        LOGN("Transition: %s -> %s", App_StateName(app.currentState), App_StateName(next_state));
        app.currentState = next_state;
    }

    /* VOC mode transitions and 10 s ticks between states (not in CONFIG due to early return) */
    VOC_Mode_Ensure();

    if (app.voc_running && app.voc_tick) {
        app.voc_tick = 0;

        uint16_t raw = 0;
        if (SGP40_ReadRawComp_HeaterOn(&hi2c1, 200, &raw) == HAL_OK) {
            app.voc_last_raw = raw;
            LOGI("VOC raw sample = %u", (unsigned)raw);
        } else {
            LOGW("VOC raw read failed");
        }
    }

    /* Short GUI status (state line + VOC partials) */
    if ((app.epd_link == EPD_LINK_CONNECTED) && app.usb_on) {
        EPD_PowerOn();
        if (!GUI_IsCanvasReady()) {
            GUI_Init();
        }
        GUI_UpdateState(app.currentState);

        if (!VOC_Active()) {
            EPD_PowerOff();
        }

        if (app.voc_running && app.voc_index_ready && app.gui_drawn_once) {
            app.voc_index_ready = 0;
            GUI_UpdateVOCIndex((uint16_t)app.voc_last_value);
        }
    } else {
        LOGW("Skipping GUI update");
        HAL_Delay(2000);
    }
}


/* ======================= State handlers ======================= */

static inline int should_do_measure(void) {
    const uint32_t now = sod_now();
    if (app.lastMeasureSeconds == 0U) return 1;
    return sod_diff(now, app.lastMeasureSeconds) >= app.cfg.interval_measure_sec;
}

/**
 * STATE_MEASURE
 *
 * - Checks USB and charger status.
 * - Performs CO2/T/RH or T/RH measurement depending on configuration.
 * - Builds the 6-byte payload (T, RH, CO2) in fixed-point format.
 * - Initializes TX baseline on first valid measurement.
 * - Manages sensor rail and I2C pull-ups, respecting VOC continuous mode.
 */
static void State_Measure(void)
{
    /* USB state always checked */
    app.usb_on = (HAL_GPIO_ReadPin(USB_ON_GPIO_Port, USB_ON_Pin) == GPIO_PIN_SET);
    LOGI("USB %s", app.usb_on ? "connected" : "disconnected");

