LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
    /* Charger status (most meaningful when USB present) */
    BQ25185_GPIO_Config(app.usb_on ? 1 : 0);
    BQ25185_GetStatus();
    BQ25185_PrintStatus();

    if (!should_do_measure()) { LOGI("MEASURE skipped (interval)"); return; }

    PS_ON(PS_SENSORS); HAL_Delay(5);
    HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_RESET); HAL_Delay(2);
    I2C_Bus_Restore_For_PowerOn();

    LOGI("Measuring values (%s)...", app.cfg.measureMode == MEAS_CO2_TRH ? "CO2+T+RH" : "T+RH only");

    if (app.cfg.measureMode == MEAS_CO2_TRH) {
        SCD41_WakeUp(&hi2c1); HAL_Delay(20);
        SCD41_SingleMeasurement_Averaged(&hi2c1);
        app.co2_data = (uint16_t)SCD_data.co2;
    } else {
        app.co2_data = 0;
    }

    SHTMeasure(&hi2c1);
    app.temp_data = (uint16_t)(SHT_data.temperature * 100.0f);
    app.hum_data  = (uint16_t)(SHT_data.rh * 100.0f);

    LOGI("T=%.2f C, RH=%.2f %%, CO2=%u ppm", SHT_data.temperature, SHT_data.rh, (unsigned)app.co2_data);

    /* payload (6B: T(.01C), RH(.01%), CO2 ppm) */
    app.payload[0] = (uint8_t)(app.temp_data >> 8); app.payload[1] = (uint8_t)(app.temp_data & 0xFF);
    app.payload[2] = (uint8_t)(app.hum_data  >> 8); app.payload[3] = (uint8_t)(app.hum_data  & 0xFF);
    app.payload[4] = (uint8_t)(app.co2_data  >> 8); app.payload[5] = (uint8_t)(app.co2_data  & 0xFF);
    LOG_Hex(app.payload, sizeof(app.payload));

    /* Prime TX baseline if needed */
    if (!app.baseline_ready) {
        memcpy(app.last_sent_payload, app.payload, sizeof(app.last_sent_payload));
        app.baseline_ready = 1;
        LOGI("TX baseline primed (no uplink yet)");
    }

    if (app.cfg.measureMode == MEAS_CO2_TRH) {
        SCD41_PowerDown(&hi2c1);
    }

    if (!VOC_Active()) {
        HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_SET); // disable pull-ups only if not in VOC
        I2C_Bus_Release_For_PowerOff();
        PS_OFF(PS_SENSORS);                                                  // power off sensors rail only if not in VOC
    } else {
        LOGI("VOC active -> keep sensor rail + I2C pull-ups ON");
    }

    app.lastMeasureSeconds = sod_now();
}

static inline int should_do_bat(void) {
    const uint32_t now = sod_now();
    if (app.lastBatSeconds == 0U) return 1;
    return sod_diff(now, app.lastBatSeconds) >= app.cfg.interval_bat_sec;
}

/**
 * STATE_BAT_MEASURE
 *
 * - Calibrates the ADC once on first use.
 * - Measures VDDA using internal VREFINT.
 * - Measures Li-Ion and SOCl2 battery channels through voltage dividers.
 * - Converts raw readings to millivolts and stores them in the app context.
 * - Optionally forwards the results to ESP (Matter) for power source reporting.
 */
static void State_BatMeasure(void)
{
    if (!should_do_bat()) { LOGI("BAT_MEASURE skipped (interval)"); return; }

    static uint8_t adc_calibrated = 0;
    if (!adc_calibrated) {
        HAL_ADC_DeInit(&hadc1);
        if (HAL_ADC_Init(&hadc1) != HAL_OK) { LOGE("ADC init failed before calibration"); Error_Handler(); }
        if (HAL_ADCEx_Calibration_Start(&hadc1) != HAL_OK) { LOGE("ADC calibration failed"); Error_Handler(); }
        adc_calibrated = 1; LOGI("ADC calibrated");
    }

    HAL_GPIO_WritePin(BAT_CTRL1_GPIO_Port, BAT_CTRL1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(BAT_CTRL2_GPIO_Port, BAT_CTRL2_Pin, GPIO_PIN_SET);
    HAL_Delay(200);

    LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(hadc1.Instance), LL_ADC_PATH_INTERNAL_VREFINT);
    HAL_Delay(1);
    ADC_ChannelConfTypeDef s = {0};
    s.Channel = ADC_CHANNEL_VREFINT; s.Rank = ADC_REGULAR_RANK_1; s.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;
    HAL_ADC_ConfigChannel(&hadc1, &s);
    HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY); (void)HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);
    uint32_t acc = 0; for (int i=0;i<VREFINT_SAMPLES;i++){ HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY); acc += HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);}
    uint32_t raw_vref = (acc + (VREFINT_SAMPLES/2U)) / VREFINT_SAMPLES;
    float vdda_mV = (float)__LL_ADC_CALC_VREFANALOG_VOLTAGE(raw_vref, LL_ADC_RESOLUTION_12B);
    LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(hadc1.Instance), LL_ADC_PATH_INTERNAL_NONE);

    /* Li-Ion on CH0 */
    s.Channel = ADC_CHANNEL_0; s.SamplingTime = ADC_SAMPLINGTIME_COMMON_2; HAL_ADC_ConfigChannel(&hadc1, &s);
    HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY); (void)HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);
    acc = 0; for (int i=0;i<BAT_SAMPLES;i++){ HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY); acc += HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);}
    uint32_t raw_liion = (acc + (BAT_SAMPLES/2U)) / BAT_SAMPLES;

    /* SOCl2 on CH1 */
    s.Channel = ADC_CHANNEL_1; HAL_ADC_ConfigChannel(&hadc1, &s);
    HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY); (void)HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);
    acc = 0; for (int i=0;i<BAT_SAMPLES;i++){ HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY); acc += HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1);}
    uint32_t raw_lsocl2 = (acc + (BAT_SAMPLES/2U)) / BAT_SAMPLES;

    HAL_GPIO_WritePin(BAT_CTRL1_GPIO_Port, BAT_CTRL1_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(BAT_CTRL2_GPIO_Port, BAT_CTRL2_Pin, GPIO_PIN_RESET);

    const float gain = (100.0f + 330.0f) / 330.0f; // 1.303
    app.vbat_lsocl2_mV = (uint16_t)((raw_lsocl2 * vdda_mV / 4095.0f) * gain + 0.5f);
    app.vbat_liion_mV  = (uint16_t)((raw_liion  * vdda_mV / 4095.0f) * gain + 0.5f);

    LOGI("raw_vref=%lu raw_liion=%lu raw_lsocl2=%lu",
         (unsigned long)raw_vref, (unsigned long)raw_liion, (unsigned long)raw_lsocl2);
    LOGI("VDDA: %.1f mV | VBAT SOCl2: %u mV | VBAT Li-Ion: %u mV",
         vdda_mV, app.vbat_lsocl2_mV, app.vbat_liion_mV);

    app.lastBatSeconds = sod_now();

    if (app.cfg.commsMode == COMMS_MATTER)
    {
    App_SendBatteryToEsp();
    }

