LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
}

/**
 * STATE_SEND_DATA
 *
 * Send the current 6-byte payload depending on communication mode:
 *  - COMMS_OFFLINE: skip transmission.
 *  - COMMS_MATTER: send HEX frame to ESP32-C6 over UART (Matter bridge).
 *  - COMMS_LORA: send confirmed uplink via WioE5 LoRaWAN modem.
 *
 * TX is further gated by ShouldTxNow() (intervals and threshold logic).
 */
/* ======================= State_SendData ======================= */
static void State_SendData(void)
{
    if (!ShouldTxNow()) { LOGI("TX skipped"); return; }

    switch (app.cfg.commsMode) {
    case COMMS_OFFLINE:
        LOGI("COMMS offline -> TX skipped");
        app.Connected = 0;
        return;

    case COMMS_MATTER: {
        LOGI("Sending ESP/Matter text frame (HEX 6B)...");
        LOG_Hex(app.payload, sizeof(app.payload));
        uint8_t ok = EspC6_DataHex(app.payload);
        if (ok) {
            memcpy(app.last_sent_payload, app.payload, sizeof(app.last_sent_payload));
            app.last_sent_seconds = sod_now();
            app.espFailCount = 0;
            LOGI("ESP TX OK");
        } else {
            app.espFailCount++;
            LOGW("ESP TX failed (cnt=%u)", app.espFailCount);
        }
        return;
    }

    case COMMS_LORA: {
        (void)Wio_Wake(1000);
        if (!app.Connected) { LOGW("LoRa not connected, skipping TX"); return; }
        LOGI("Sending LoRa data (CONFIRMED)...");
        LOG_Hex(app.payload, sizeof(app.payload));
        WioSendResult_t r = Wio_SendData(app.payload, sizeof(app.payload));
        switch (r) {
            case WIO_SEND_ACK_RECEIVED:
                LOGI("ACK received");
                app.loraNoAckCount = 0;
                app.Connected = 1;
                memcpy(app.last_sent_payload, app.payload, sizeof(app.last_sent_payload));
                app.last_sent_seconds = sod_now();
                break;
            case WIO_SEND_NO_ACK:
                LOGW("No ACK");
                app.loraNoAckCount++;
                break;
            default:
                LOGE("Send error");
                app.loraNoAckCount++;
                break;
        }
        return;
    }
    }
}


/**
 * STATE_RECOVER
 *
 * Communication recovery common entry point:
 *  - For Matter (ESP): perform hardware reset after repeated TX failures,
 *    and periodically check STATUS to update connectivity flag.
 *  - For LoRa: re-join network if disconnected or after too many missed ACKs.
 *  - For Offline: no recovery is needed.
 */
/* ======================= Recover ======================= */
/* ======================= State_Recover (generic) ======================= */
static void State_Recover(void)
{
    /* ESP (Matter) – if repeated failures, try HW reset */
    if (app.cfg.commsMode == COMMS_MATTER) {
        if (app.espFailCount >= 5)
        {
        	app.Connected = 0;
            LOGW("ESP recover: %u consecutive TX fails -> HW reset", app.espFailCount);
            ESP_ResetPulse();
            app.espFailCount = 0;
        }
        else
        {
            LOGI("ESP recover: ok (fails=%u < 3)", app.espFailCount);

            uint8_t ok = EspC6_SendCommand("STATUS?", "STATUS ONLINE", 5000);
            app.Connected = ok ? 1 : 0;
        }
    }

    /* LoRa – legacy recovery (rejoin), formerly State_LoraRecover */
    if (app.cfg.commsMode == COMMS_LORA) {
        LOGB("LoRa Recovery");
        if (app.Connected && app.loraNoAckCount < 3) {
            LOGI("LoRa OK (noAck=%u)", (unsigned)app.loraNoAckCount);
            return;
        }
        if (!app.Connected)
            LOGW("Not connected → re-join required");
        else
            LOGW("Too many missed ACKs (%u ≥ %u)", (unsigned)app.loraNoAckCount, 3U);

        if (!Wio_EnsureReady(1500)) LOGE("Modem unresponsive!");
        Wio_SendCommand("AT+RESET", "OK", 5000); HAL_Delay(2000);
        if (Wio_SendCommand("AT+JOIN", "Network joined", 30000)) {
            app.Connected = 1; app.loraNoAckCount = 0; LOGI("Re-join OK");
        } else {
            app.Connected = 0; LOGE("Re-join FAILED");
        }
    }
    /* Offline – nothing to do */
}


/* ======================= State_TimeReq ======================= */
/**
 * STATE_TIME_REQ
 *
 * LoRa-only time synchronization:
 *  - Sends a time request on a dedicated port after:
 *      * initial boot (no previous sync),
 *      * configured interval has elapsed,
 *      * previous request failed.
 *  - Updates RTC and internal flags on success.
 */
static void State_TimeReq(void)
{
    if (app.cfg.commsMode != COMMS_LORA) {
        LOGI("TIME_REQ skipped (not LoRa)");
        return;
    }

    const uint32_t now  = sod_now();
    const uint32_t diff = (app.lastTimeSyncSeconds == 0xFFFFFFFFU) ? 0xFFFFFFFFU
                                                                   : sod_diff(now, app.lastTimeSyncSeconds);
    static uint8_t lastTimeReqOk = 1U;

    if (app.lastTimeSyncSeconds == 0xFFFFFFFFU || diff >= app.cfg.interval_time_req_sec || lastTimeReqOk == 0U) {
        if (app.Connected) {
            (void)Wio_Wake(800);
            LOGI("Sending TIME request (port 8)...");
            Wio_SendCommand("AT+PORT=8", "+PORT", 500);
            lastTimeReqOk = WioTimeReq();
            if (lastTimeReqOk) {
                app.lastTimeSyncSeconds = sod_now();
                app.time_sync_ok = 1;
                LOGI("TIME sync OK");
            } else {
                LOGW("TIME sync failed");
                app.time_sync_ok = 0;
            }
        } else {
            LOGW("LoRa not connected. Skipping TIME request");
        }
    } else {
        LOGI("Skipping TIME request, next in ~%lus",
             (unsigned long)(app.cfg.interval_time_req_sec - diff));
    }
    RTC_Print_DateTime();
}


/**
 * STATE_GUI
 *
 * Full-screen GUI rendering:
 *  - Skips if E-Ink is not connected.
 *  - Uses ShouldGUIRefreshNow() to avoid unnecessary full refreshes.
 *  - On refresh, powers E-Ink rail, draws the screen, then powers off.
 *  - Stores last drawn payload and GUI meta snapshot for change detection.
 */
static void State_GUI(void)
{
    if (app.epd_link != EPD_LINK_CONNECTED) {
        LOGW("E-Ink disconnected -> skipping GUI screen");
        return;
    }

