LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
    if (!ShouldGUIRefreshNow()) {
        LOGI("GUI skipped (no significant change)");
        return;
    }

    EPD_PowerOn();
    LOGI("Updating E-Ink display (change-based / first-run)...");
    GUI_Display();
    EPD_PowerOff();

    /* Remember what we drew and mark that we've done at least one full draw */
    memcpy(app.last_gui_payload, app.payload, sizeof(app.last_gui_payload));
    app.gui_drawn_once = 1;

    s_gui_meta_prev = BuildGuiMetaSnapshot();
    s_gui_meta_prev_valid = 1;
}

/**
 * STATE_SLEEP
 *
 * Enter STOP2 low-power mode if safe:
 *  - Skips STOP2 when USB is connected and continuous VOC mode is enabled.
 *  - Skips STOP2 while user button is pressed.
 *  - Powers down sensors, GUI, and (for LoRa) puts modem into low-power mode.
 *  - Uses RTC wake-up timer to sleep for interval_sleep_sec.
 */
/* ======================= State_Sleep (LoRa sleep only) ======================= */
static void State_Sleep(void)
{
    if (app.usb_on && app.cfg.vocMode == VOC_CONT_USB) {
        LOGI("USB+VOC active -> skip STOP2");
        HAL_Delay(50);
        return;
    }

    if (!IsButtonReleased()) {
        LOGW("Sleep blocked: user button pressed");
        HAL_Delay(50);
        return;
    }

    HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_SET);
    I2C_Bus_Release_For_PowerOff();
    PS_OFF(PS_SENSORS);

    if (!app.usb_on) {
        BQ25185_GPIO_Config(0);
    }

    if (app.epd_link == EPD_LINK_CONNECTED) {
        EPD_PowerOff();
    }

    /* Internal low-power mode only for LoRa modem */
    if (app.cfg.commsMode == COMMS_LORA)
        Wio_SleepEnter();

    app.cfg.interval_sleep_sec = (app.cfg.interval_sleep_sec == 0U) ? 1U : app.cfg.interval_sleep_sec;
    LOGI("Entering STOP2 for %lu s", (unsigned long)app.cfg.interval_sleep_sec);

    GPIO_PrepareForSleep_Simple();
    HAL_SuspendTick();
    HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, app.cfg.interval_sleep_sec, RTC_WAKEUPCLOCK_CK_SPRE_16BITS, 0);
    HAL_PWREx_EnterSTOP2Mode(PWR_STOPENTRY_WFI);

    SystemClock_Config();
    HAL_ResumeTick();
}


/**
 * STATE_RECALIBRATION
 *
 * Force recalibration of the SCD41 sensor to 400 ppm baseline.
 * Triggered by a long button press.
 * Steps:
 *  - Power sensor rail and I2C pull-ups.
 *  - Wake up SCD41 and perform force recalibration.
 *  - Optionally re-initialize GUI (show recalibration icon/screen).
 *  - Clean up power rails and clear recalibration flag.
 */
static void State_Recalib(void)
{
    PS_ON(PS_SENSORS); HAL_Delay(10);
    HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_RESET); HAL_Delay(2);
    I2C_Bus_Restore_For_PowerOn();
    SCD41_WakeUp(&hi2c1); HAL_Delay(30);

    if (app.epd_link == EPD_LINK_CONNECTED) {
        EPD_PowerOn();
        HAL_Delay(50);
        GUI_Init();
    }

    LOGI("Recalibrating SCD41 sensor to 400 ppm...");
    SCD41_ForceRecalibration(&hi2c1, 400);

    if (app.epd_link == EPD_LINK_CONNECTED) {
        EPD_PowerOff();
    }

    app.recalibFlag = 0;
    HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_SET);
    I2C_Bus_Release_For_PowerOff();
    PS_OFF(PS_SENSORS);

    LOGI("Recalibration done");
}

/**
 * STATE_CONFIG
 *
 * Silent UART4 configuration mode with E-Ink icon and OK/ERR bar.
 *
 * Behavior:
 *  - On first entry:
 *      * Stops VOC and sensors, optionally idles radio.
 *      * In Matter mode, powers ESP for QR/STATUS commands (WAKE low).
 *      * Draws configuration icon on E-Ink.
 *      * Starts the configuration console on UART4 (with inactivity timeout).
 *  - On each subsequent call:
 *      * Polls the console (command parser, timeouts).
 *      * Exits on second 5 s button press or console exit/inactivity.
 *  - On exit:
 *      * Stops console, re-initializes GUI, and resets boot flags so that
 *        the main application restarts in a clean INIT state.
 */
/* ======================= State_Config ======================= */
static void State_Config(void)
{
    static uint8_t started = 0;

    if (!started) {
        /* --- one-time entry --- */
        LOGB("CONFIG ENTER");

        PS_ON(PS_RF);
        HAL_Delay(200);

        /* Stop VOC + sensors and optionally put radio back to idle */
        if (app.voc_running) {
            VOC_LPTIM_Stop();
            voc_algo_inited = 0;
            app.voc_running = 0;
        }
        app.voc_tick = 0;

        /* In Matter mode enable ESP power for QR/STATUS commands; keep WAKE low */
        if (app.cfg.commsMode == COMMS_MATTER) {
            PS_ON(PS_RF);
            HAL_GPIO_WritePin(RF_RST_GPIO_Port, RF_RST_Pin, GPIO_PIN_SET); /* if used as EN */
            HAL_GPIO_WritePin(RF_GPIO1_GPIO_Port, RF_GPIO1_Pin, GPIO_PIN_RESET); /* WAKE LOW */
        }

        /* E-Ink: show configuration icon */
        if (app.epd_link == EPD_LINK_CONNECTED) {
            EPD_PowerOn();
            GUI_DrawConfIcon();
            /* You can keep EPD on for partial OK/ERR updates */
        }

        /* Start UART4 configuration console */
        ConfConsole_Init(&(ConfConsole_Init_t){
            .huart = &huart4,
            .cfg = &app.cfg,
            .sod_now = sod_now,
            .inactivity_s = 10*60
        });
        ConfConsole_Start();
        ConfConsole_PrintBanner(); /* UART: "CONFIG MODE", E-Ink: "Ready" */

        started = 1;
        return; /* after entering, immediately hand over control to console */
    }

    /* --- regular loop while in CONFIG state --- */
    ConfConsole_Poll();

    /* Exit on second 5 s button hold or on EXIT/inactivity */
    if (app.confFlag >= 2 || ConfConsole_ShouldExit()) {
        LOGB("CONFIG EXIT");

        ConfConsole_Stop();

//        if (app.epd_link == EPD_LINK_CONNECTED) {
//            EPD_PowerOn();
//            GUI_Init();
//            EPD_PowerOff();
//        }
//
//        if (app.cfg.commsMode == COMMS_OFFLINE) PS_OFF(PS_RF);

        /* Return to a "clean" state */
        app.boot_done      = 0;
        app.wakeUpFlag     = 0;
        app.gui_drawn_once = 0;
        app.confFlag       = 0;
        started            = 0;

        app.currentState = STATE_INIT;
        return;
    }
}

/* ======================= VOC helpers & LPTIM2 ======================= */
/**
 * Ensure VOC mode matches current configuration and USB state.
 *
 * - In CONFIG state, VOC is always forced off (safety guard).
 * - In continuous VOC mode with USB present:
 *      * Keeps sensor rail and I2C pull-ups ON.
 *      * Initializes VOC algorithm with 10 s sampling interval.
 *      * Starts LPTIM2 periodic interrupt.
 *      * Optionally powers E-Ink for quick UI updates.
 * - When VOC should stop:
 *      * Stops LPTIM2, de-inits algorithm, powers down sensors and E-Ink.
 */
static void VOC_Mode_Ensure(void)
{
    /* In CONFIG state keep VOC off (safety guard). */
    if (app.currentState == STATE_CONFIG) {
        if (app.voc_running) {
            LOGI("VOC stop (CONFIG)");
            VOC_LPTIM_Stop();
            voc_algo_inited = 0;
            HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_SET);
            I2C_Bus_Release_For_PowerOff();
            PS_OFF(PS_SENSORS);
            if (app.epd_link == EPD_LINK_CONNECTED) {
                EPD_PowerOff();
            }
            app.voc_running = 0;
        }
        return;
    }

    const uint8_t should_run = (app.cfg.vocMode == VOC_CONT_USB) && (app.usb_on != 0);

    if (should_run && !app.voc_running) {
        LOGI("VOC start (USB ON)");

        /* Keep sensors rail and I2C pull-ups on while VOC runs */
        PS_ON(PS_SENSORS);
        HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_RESET);
        I2C_Bus_Restore_For_PowerOn();

