LogicElements/matter-lora-env-node/firmware/stm32/Core/Src/app.c
        /* VOC algorithm @ 10 s interval */
        GasIndexAlgorithm_init_with_sampling_interval(
            &voc_algo, GasIndexAlgorithm_ALGORITHM_TYPE_VOC, 10.0f);
        voc_algo_inited = 1;
        app.voc_index_ready = 0;

        if (app.epd_link == EPD_LINK_CONNECTED) {
            EPD_PowerOn(); /* allow quick partial UI refresh if desired */
        }
        VOC_LPTIM_Start();
        app.voc_running = 1;
    }
    else if (!should_run && app.voc_running) {
        LOGI("VOC stop");
        VOC_LPTIM_Stop();
        voc_algo_inited = 0;

        HAL_GPIO_WritePin(PULL_CNTR_GPIO_Port, PULL_CNTR_Pin, GPIO_PIN_SET);
        I2C_Bus_Release_For_PowerOff();
        PS_OFF(PS_SENSORS);
        if (app.epd_link == EPD_LINK_CONNECTED) {
            EPD_PowerOff();
        }
        app.voc_running = 0;
    }
}

/** Start LPTIM2 to tick every 10 s (ARR match IRQ). */
static void VOC_LPTIM_Start(void)
{
    /* Ensure peripheral low-level init (enables clock, NVIC, GPIO as defined in your MSP). */
    HAL_LPTIM_MspInit(&hlptim2);

    /* Make sure the counter is stopped before (re)configuring. */
    (void)HAL_LPTIM_Counter_Stop_IT(&hlptim2);

#if defined(__HAL_LPTIM_AUTORELOAD_SET)
    __HAL_LPTIM_AUTORELOAD_SET(&hlptim2, LPTIM2_10S_ARR);
#else
    __HAL_LPTIM_SET_AUTORELOAD(&hlptim2, LPTIM2_10S_ARR);
#endif

    /* Clear ARRM flag before starting to avoid a spurious first interrupt. */
    __HAL_LPTIM_CLEAR_FLAG(&hlptim2, LPTIM_FLAG_ARRM);

    /* Start periodic counter with interrupts. */
    if (HAL_LPTIM_Counter_Start_IT(&hlptim2) != HAL_OK) {
        LOGE("LPTIM2 start failed");
    } else {
        LOGI("LPTIM2 started");
    }
}

/** Stop LPTIM2 periodic tick and fully de-initialize to save power. */
static void VOC_LPTIM_Stop(void)
{
    /* Stop counter & interrupts first. */
    HAL_LPTIM_Counter_Stop_IT(&hlptim2);

    /* Disable the peripheral (keeps registers/flags quiet before MSP deinit). */
    __HAL_LPTIM_DISABLE(&hlptim2);

    /* Optionally clear pending flags (defensive). */
    __HAL_LPTIM_CLEAR_FLAG(&hlptim2, LPTIM_FLAG_ARRM);

    /* Low-level deinit (disables NVIC and peripheral clock as defined in your MSP). */
    HAL_LPTIM_MspDeInit(&hlptim2);
}


/* ======================= EPD power helpers ======================= */
/**
 * Power up E-Ink rail and SPI, initialize panel driver, and notify GUI
 * that the display has been resumed (for partial updates / cache).
 */
static void EPD_WaitPowerStable(void)
{
    uint32_t delay_ms = 200;
    HAL_Delay(delay_ms);
}

static void EPD_PowerOn(void)
{
    PS_ON(PS_EINK);
    EPD_WaitPowerStable();
    MX_SPI1_Init();
    EPD_Pins_Init();
    DEV_Module_Init();
    EPD_2in13_V4_Init();
    GUI_OnEPDResumed();
}

/**
 * Put E-Ink into deep sleep, release SPI and pins to Hi-Z,
 * and disable the display power rail to save energy.
 */
static void EPD_PowerOff(void)
{
    EPD_2in13_V4_Sleep();
    DEV_Digital_Write(EPD_CS_PIN, 1);
    DEV_Digital_Write(EPD_DC_PIN, 0);
    HAL_SPI_DeInit(&hspi1);
    EPD_Pins_HiZ();
    HAL_Delay(80);
    PS_OFF(PS_EINK);
}

/**
 * Generate a reset pulse for ESP32-C6 by toggling RF_RST pin.
 * Ensures RF power rail is on, applies low-high sequence with delays,
 * and logs completion.
 */
static void ESP_ResetPulse(void)
{
    /* Make sure RF power rail is on */
    PS_ON(PS_RF);
    /* LOW -> short delay -> HIGH -> stabilization delay */
    HAL_GPIO_WritePin(RF_RST_GPIO_Port, RF_RST_Pin, GPIO_PIN_RESET);
    HAL_Delay(50);
    HAL_GPIO_WritePin(RF_RST_GPIO_Port, RF_RST_Pin, GPIO_PIN_SET);
    HAL_Delay(300);
    LOGI("ESP reset pulse done");
}

/*
 * One-shot, quick E-Ink presence test during boot.
 * Temporarily powers the display rail, brings up SPI and pins,
 * performs a SWRESET with timeout, decides CONNECTED/DISCONNECTED,
 * and then always powers everything back down.
 */
static void EPD_BootDetect(void)
{
    if (app.epd_link != EPD_LINK_CONNECTED) {
        LOGW("E-Ink disabled by user -> skipping probe");
        return;
    }

    uint8_t ok = 0;
    uint32_t timeout_ms = app.usb_on ? 2000U : 5000U;

    for (int attempt = 0; attempt < 2 && !ok; ++attempt) {
        PS_ON(PS_EINK);
        EPD_WaitPowerStable();
        MX_SPI1_Init();
        EPD_Pins_Init();
        HAL_Delay(20);
        DEV_Module_Init();
        HAL_Delay(20);

        ok = EPD_2in13_V4_BootDetect(timeout_ms);
        if (!ok) {
            EPD_PowerOff();
            HAL_Delay(300);
        }
    }

    if (!ok) {
        LOGW("E-Ink not responding during boot probe (will retry later)");
    } else {
        LOGI("E-Ink present (boot probe OK)");
    }

    EPD_PowerOff();   /* always clean up safely */
}


/* -------------------------------------------------------------------------- */
/* Sending battery information to ESP32-C6 over UART (Matter text protocol)   */
/* Frame format:                                                              */
/*   DATA BAT KV LI=<mV> LS=<mV> USB=<0|1> CHG=<0..6>                         */
/* -------------------------------------------------------------------------- */
/**
 * Send current battery status to ESP32-C6 (Matter Power Source cluster).
 *
 * Uses a text frame of the form:
 *   DATA BAT KV LI=<mV> LS=<mV> USB=<0/1> CHG=<0..6>
 *
 * Only active when COMMS_MATTER is selected.
 */
static void App_SendBatteryToEsp(void)
{
    /* Send only in COMMS_MATTER mode */
    if (app.cfg.commsMode != COMMS_MATTER) {
        return;
    }

    uint16_t li_mV  = app.vbat_liion_mV;
    uint16_t ls_mV  = app.vbat_lsocl2_mV;
    uint8_t  usb_on = app.usb_on ? 1U : 0U;
    uint8_t  chg    = (uint8_t)app.charger_status; /* BQ25185_Status_t -> uint8_t */

    uint8_t ok = EspC6_DataBat(li_mV, ls_mV, usb_on, chg);
    if (!ok) {
        LOGW("ESP BAT TX failed (LI=%u mV, LS=%u mV, USB=%u, CHG=%u)",
             (unsigned)li_mV, (unsigned)ls_mV, (unsigned)usb_on, (unsigned)chg);
    } else {
        LOGI("ESP BAT TX OK (LI=%u mV, LS=%u mV, USB=%u, CHG=%u)",
             (unsigned)li_mV, (unsigned)ls_mV, (unsigned)usb_on, (unsigned)chg);
    }
}




/* ======================= LPTIM2 IRQ callback ======================= */
/**
 * LPTIM2 AutoReloadMatch callback:
 *  - Logs the tick.
 *  - When VOC is running and algorithm is initialized, processes the last
 *    raw VOC value into an index, clamps it, and stores timestamp and index.
 *  - Signals main loop via voc_index_ready flag to update GUI outside ISR.
 */
void HAL_LPTIM_AutoReloadMatchCallback(LPTIM_HandleTypeDef *hlptim)
{
    if (hlptim->Instance != LPTIM2) return;

    if (app.voc_running && voc_algo_inited) {
        const uint16_t raw = app.voc_last_raw; /* 16-bit read is atomic on CM0+ */
        int32_t voc_idx32 = 0;
        GasIndexAlgorithm_process(&voc_algo, (int32_t)raw, &voc_idx32);
        if (voc_idx32 < 0) voc_idx32 = 0;
        if (voc_idx32 > 65535) voc_idx32 = 65535;

        app.voc_last_value  = (uint16_t)voc_idx32;
        app.voc_last_time   = g_timeData;      /* timestamp for UI */
        app.voc_index_ready = 1;               /* GUI (outside ISR) may do a partial update */
    }

    /* Ask the main loop to fetch a fresh raw sample when convenient */
    App_VOC_TickIRQ();
}

/* ======================= UART RX complete (feed config console) ======================= */
/**
 * Generic HAL UART RX complete callback.
 * For this application, it forwards received characters
 * into the configuration console (if active).
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    /* your other UART handling could be here ... */

    /* Feed config console (active only in CONFIG state). */
    ConfConsole_OnRxCplt(huart);
}

/* ======================= RTC WAKE UP IRQ callback ======================= */
void HAL_RTCEx_WakeUpTimerEventCallback(RTC_HandleTypeDef *hrtc)
{
	App_WakeUpIRQ();
}


/* ======================= GPIO EXT rising callback ======================= */

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == BUTTON_Pin)
    {
    	App_WakeUpIRQ();
        ButtonHandler_EXTI_Callback();
    }

    if (GPIO_Pin == USB_ON_Pin)
    {
    	App_WakeUpIRQ();
    }

}

/* ======================= GPIO EXT falling callback ======================= */

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == BUTTON_Pin)
    {
    	App_WakeUpIRQ();
        ButtonHandler_EXTI_Callback();
    }
}
